Tekla Open API Reference for Tekla Structures 2025
ReinforcementGroup.Attributes Property
 The attributes of the reinforcement. For more information see ReinforcementBase.ReinforcementGroupAttributes.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public ReinforcementBase.ReinforcementGroupAttributes Attributes { get; set; }
Public Property Attributes As ReinforcementBase.ReinforcementGroupAttributes
	Get
	Set
Property Value
Type: ReinforcementBase.ReinforcementGroupAttributes
See Also
Reference
ReinforcementGroup Class
Tekla.Structures.Drawing Namespace